tap "alecharmon/tap"
tap "netbirdio/tap"
tap "nubjs/tap"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Firebase command-line tools
brew "firebase-cli"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Idiomatic, lean, fast & safe pure Rust implementation of Git
brew "gitoxide"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Colorize your kubectl output
brew "kubecolor"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Mac App Store command-line interface
brew "mas"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Fast, disk space efficient package manager
brew "pnpm"
# Cloud native development platform
brew "pulumi"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Powerful, clean, object-oriented scripting language
brew "ruby", link: false
# Safe, concurrent, practical language
brew "rust"
# CLI for out-of-band management of Kubernetes nodes created by Talos
brew "talosctl"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# UNIX shell (command interpreter)
brew "zsh"
# Netbird project.
brew "netbirdio/tap/netbird", trusted: true
# Fast TypeScript runtime and package manager that augments Node
brew "nubjs/tap/nub", trusted: true
# Use your phone as a high-quality webcam with image tuning controls
cask "camo-studio"
# Open links in any browser
cask "choosy"
# Track and budget money
cask "copilot-money"
# API documentation browser and code snippet manager
cask "dash"
# Voice and text chat software
cask "discord"
# Regular expressions manager app
cask "expressions"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Web browser
cask "google-chrome"
# Native desktop AI assistant from Google
cask "google-gemini"
# Desktop automation application
cask "hammerspoon"
# HTTP and GraphQL Client
cask "insomnia"
# System monitoring app
cask "istat-menus"
# Spot and merge differences in text and image files or folders
cask "kaleidoscope"
# Keyboard customiser
cask "karabiner-elements"
# AI-powered productivity tool for the command-line
cask "kiro-cli"
# Application launcher
cask "leader-key"
# Kubernetes IDE
cask "lens"
# Software for Logitech devices
cask "logi-options+"
# Support for Logitech G gear
cask "logitech-g-hub"
# Netbird UI Client
cask "netbirdio/tap/netbird-ui", trusted: true
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Replacement for Docker Desktop
cask "orbstack"
# Home media player
cask "plex"
# HTTP debugging proxy
cask "proxyman"
# Companion app for Flipper Zero devices
cask "qflipper"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Video game digital distribution service
cask "steam"
# Native GUI tool for relational databases
cask "tableplus"
# Zero trust network access platform
cask "twingate"
# OpenVPN client with AppleScript support
cask "viscosity"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Scan, monitor, and troubleshoot wireless networks
cask "wifi-explorer"
# Network monitoring and troubleshooting tool
cask "wifiman"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Blocker", id: 1365531024
mas "Capo", id: 696977615
mas "ControllerForHomeKit", id: 1198176727
mas "Deliveries", id: 290986013
mas "Flighty", id: 1358823008
mas "iCircuit", id: 454347770
mas "iMovie", id: 408981434
mas "Logic Pro", id: 634148309
mas "Mapper", id: 1589391989
mas "Raycast Companion", id: 6738274497
mas "Xcode", id: 497799835
vscode "ahebrank.yaml2json"
vscode "bbenoist.nix"
vscode "bennycode.sort-everything"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "dnicolson.binary-plist"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "ezzak.current-path"
vscode "formulahendry.code-runner"
vscode "github.vscode-github-actions"
vscode "hangxingliu.vscode-nginx-conf-hint"
vscode "idleberg.applescript"
vscode "idleberg.jxa"
vscode "jock.svg"
vscode "johnreemar.vscode-qwik-snippets"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "naumovs.color-highlight"
vscode "pustelto.bracketeer"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "sammcleod.ghostty-config-syntax"
vscode "sidneys1.gitconfig"
vscode "stylelint.vscode-stylelint"
vscode "subframe7536.custom-ui-style"
vscode "sumneko.lua"
vscode "swiftlang.swift-vscode"
vscode "syler.ignore"
vscode "tamasfe.even-better-toml"
vscode "that70schris.arcade"
vscode "tonka3000.raycast"
vscode "unifiedjs.vscode-mdx"
vscode "vadimcn.vscode-lldb"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wangwindow.quick-open-in-new-window"
vscode "zongou.vs-seti-hacknerdfont"
cargo "starship"
npm "corepack"
