brew "autoenv"
brew "ctop"
brew "dash-shell"
brew "node"
brew "firebase-cli"
brew "fish"
brew "gh"
brew "git"
brew "gitoxide"
brew "go"
brew "helm"
brew "htop"
brew "httpie"
brew "k6"
brew "kubecolor"
brew "kubernetes-cli"
brew "mas"
brew "nginx"
brew "pkgconf"
brew "pnpm"
brew "pulumi"
brew "ruby"
brew "rust"
brew "sox"
brew "starship"
brew "xh"
brew "zsh"
cask "arc"
cask "camo-studio"
cask "choosy"
cask "copilot-money"
cask "dash"
cask "discord"
cask "dropbox"
cask "expressions"
cask "gcloud-cli"
cask "google-chrome"
cask "hammerspoon"
cask "hdhomerun"
cask "insomnia"
cask "istat-menus"
cask "iterm2"
cask "kaleidoscope"
cask "karabiner-elements"
cask "keyboard-cowboy"
cask "kiro-cli"
cask "leader-key"
cask "lens"
cask "logi-options+"
cask "logitech-g-hub"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "orbstack"
cask "plex"
cask "proxyman"
cask "qflipper"
cask "raspberry-pi-imager"
cask "raycast"
cask "slack"
cask "steam"
cask "tableplus"
cask "tailscale-app"
cask "twingate"
cask "viscosity"
cask "visual-studio-code"
cask "warp"
cask "wifiman"
cask "zoom"
mas "1Blocker", id: 1365531024
mas "Deliveries", id: 290986013
mas "Flighty", id: 1358823008
mas "HomeControl", id: 1547121417
mas "Homie", id: 1533590432
mas "iCircuit", id: 454347770
mas "Logic Pro", id: 634148309
mas "Mapper", id: 1589391989
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "WiFi Explorer", id: 494803304
mas "Xcode", id: 497799835
vscode "bbenoist.nix"
vscode "bennycode.sort-everything"
vscode "britesnow.vscode-toggle-quotes"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "dnicolson.binary-plist"
vscode "docker.docker"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "ezzak.current-path"
vscode "fantasy.vscode-raycast-script-commands"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "hangxingliu.vscode-nginx-conf-hint"
vscode "idleberg.applescript"
vscode "jock.svg"
vscode "johnreemar.vscode-qwik-snippets"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-repositories"
vscode "naumovs.color-highlight"
vscode "pustelto.bracketeer"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "sidneys1.gitconfig"
vscode "stylelint.vscode-stylelint"
vscode "subframe7536.custom-ui-style"
vscode "sumneko.lua"
vscode "swiftlang.swift-vscode"
vscode "syler.ignore"
vscode "tamasfe.even-better-toml"
vscode "that70schris.arcade"
vscode "tonka3000.raycast"
vscode "unifiedjs.vscode-mdx"
vscode "vadimcn.vscode-lldb"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
