tap "hidetatz/tap"
brew "autoenv"
brew "composer"
brew "ctop"
brew "dash"
brew "node"
brew "firebase-cli"
brew "gh"
brew "git"
brew "gitoxide"
brew "go"
brew "helm"
brew "htop"
brew "httpie"
brew "k6"
brew "kubernetes-cli"
brew "mas"
brew "nginx"
brew "pkgconf"
brew "pnpm"
brew "pulumi"
brew "ruby"
brew "rust"
brew "starship"
brew "zsh"
brew "hidetatz/tap/kubecolor"
cask "amazon-q"
cask "arc"
cask "azure-data-studio"
cask "camo-studio"
cask "chatgpt"
cask "choosy"
cask "dash"
cask "discord"
cask "docker"
cask "dropbox"
cask "google-chrome"
cask "google-cloud-sdk"
cask "hammerspoon"
cask "insomnia"
cask "intune-company-portal"
cask "istat-menus"
cask "iterm2"
cask "kaleidoscope"
cask "karabiner-elements"
cask "lastpass"
cask "leader-key"
cask "lens"
cask "logi-options+"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "ngrok"
cask "orbstack"
cask "proxyman"
cask "raspberry-pi-imager"
cask "raycast"
cask "slack"
cask "tableplus"
cask "tailscale"
cask "twingate"
cask "viscosity"
cask "visual-studio-code"
cask "warp"
cask "wifiman"
cask "zoom"
mas "1Blocker", id: 1365531024
mas "CatoClient", id: 1128104033
mas "Copilot", id: 1447330651
mas "Deliveries", id: 290986013
mas "Expressions", id: 913158085
mas "Flighty", id: 1358823008
mas "iCircuit", id: 454347770
mas "Karo Graph", id: 557536642
mas "monday.com", id: 1298450641
mas "Prime Video", id: 545519333
mas "WiFi Explorer", id: 494803304
mas "Xcode", id: 497799835
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "angular.ng-template"
vscode "bbenoist.nix"
vscode "bennycode.sort-everything"
vscode "bmewburn.vscode-intelephense-client"
vscode "britesnow.vscode-toggle-quotes"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "docker.docker"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "ezzak.current-path"
vscode "formulahendry.code-runner"
vscode "genuitec.angular-cli-task-provider"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "hangxingliu.vscode-nginx-conf-hint"
vscode "idleberg.applescript"
vscode "jock.svg"
vscode "johnreemar.vscode-qwik-snippets"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "mrmlnc.vscode-apache"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "pustelto.bracketeer"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "sidneys1.gitconfig"
vscode "subframe7536.custom-ui-style"
vscode "sumneko.lua"
vscode "swiftlang.swift-vscode"
vscode "syler.ignore"
vscode "tamasfe.even-better-toml"
vscode "that70schris.arcade"
vscode "tonka3000.raycast"
vscode "unifiedjs.vscode-mdx"
vscode "vadimcn.vscode-lldb"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
